/**
 * 导购
 * Created by WangChao on 2017/1/10.
 */
var guide = function (fn) {
    this.fn = fn;
};
guide.prototype = {
    /**
     * 导购列表
     * pageSize 页大小
     * pageNumber 页号
     * lat 纬度
     * lnt 经度
     * tenantCategoryId 商家分类Id
     * type   （全部传1）
     * isIndex 是否首页推荐(首页传true)
     * isChannel 是否频道推荐（频道页传true）
     */
    list: function (data) {
        if(location.hostname=="www.tiaohuo.com"){
            if (!data) data = {};
            data.usernames = [
                13515515899,
                18056002255,
                13122188592,
                13585686861,
                18255739853,
                18355101077,
                15156893712,
                13381725519,
                18856756667,
                15055178221,
                18297911824,
                18655751655,
                18555504050,
                18326691891,
                17605603395,
                13023055999,
                18715082012,
                15391986777,
                13865913413,
                15855150065,
                15705548333,
                13185951717,
                15222917309,
                15905691198,
                13155132508,
                15155190234,
                15655876869,
                18119563761,
                18955165223,
                13916926389,
                15375395651,
                15961304757,
                18019957906,
                13966696625,
                13866782068,
                18356958114,
                15256985095,
                13505511878,
                17705650877,
                18963795498,
                13083440381,
                18905697802,
                18756002836,
                13956743662,
                13349295795,
                15255560423,
                15395192423,
                15056956025,
                13856919304,
                13721054751,
                15155138673,
                13865511161,
                17681179208,
                13865962700,
                15956983877,
                13739249995,
                15855158486,
                18715061721,
                13866669221,
                13956056477,
                17751718600,
                15395130118,
                15375408536,
                13485510006,
                18856061342,
                15856904181,
                18756060793,
                18256902676,
                13301064017,
                13966768587
            ];
        }
        ajax.get({
            url: base + 'weixin/guide/list.jhtml',
            data: data,
            traditional: true,
            success: this.fn
        });
    },
    /**
     * 导购列表首页接口
     * pageSize 页大小
     * pageNumber 页号
     * tenantCategoryId 商家分类Id
     * type   （全部传1）
     */
    indexList: function (data) {
        if(location.hostname=="www.tiaohuo.com"){
            if (!data) data = {};
            data.usernames = [
                13515515899,
                18056002255,
                13122188592,
                13585686861,
                18255739853,
                18355101077,
                15156893712,
                13381725519,
                18856756667,
                15055178221,
                18297911824,
                18655751655,
                18555504050,
                18326691891,
                17605603395,
                13023055999,
                18715082012,
                15391986777,
                13865913413,
                15855150065,
                15705548333,
                13185951717,
                15222917309,
                15905691198,
                13155132508,
                15155190234,
                15655876869,
                18119563761,
                18955165223,
                13916926389,
                15375395651,
                15961304757,
                18019957906,
                13966696625,
                13866782068,
                18356958114,
                15256985095,
                13505511878,
                17705650877,
                18963795498,
                13083440381,
                18905697802,
                18756002836,
                13956743662,
                13349295795,
                15255560423,
                15395192423,
                15056956025,
                13856919304,
                13721054751,
                15155138673,
                13865511161,
                17681179208,
                13865962700,
                15956983877,
                13739249995,
                15855158486,
                18715061721,
                13866669221,
                13956056477,
                17751718600,
                15395130118,
                15375408536,
                13485510006,
                18856061342,
                15856904181,
                18756060793,
                18256902676,
                13301064017,
                13966768587
            ];
        }
        ajax.get({
            url: base + 'weixin/guide/indexList.jhtml',
            data: data,
            traditional: true,
            success: this.fn
        });
    },
    /**
     * 首页推荐导购
     * pageSize 页大小
     * pageNumber 页号
     */
    firstRecommend: function (data) {
        if(location.hostname=="www.tiaohuo.com"){
            if (!data) data = {};
            data.usernames = [
                13515515899,
                18056002255,
                13122188592,
                13585686861,
                18255739853,
                18355101077,
                15156893712,
                13381725519,
                18856756667,
                15055178221,
                18297911824,
                18655751655,
                18555504050,
                18326691891,
                17605603395,
                13023055999,
                18715082012,
                15391986777,
                13865913413,
                15855150065,
                15705548333,
                13185951717,
                15222917309,
                15905691198,
                13155132508,
                15155190234,
                15655876869,
                18119563761,
                18955165223,
                13916926389,
                15375395651,
                15961304757,
                18019957906,
                13966696625,
                13866782068,
                18356958114,
                15256985095,
                13505511878,
                17705650877,
                18963795498,
                13083440381,
                18905697802,
                18756002836,
                13956743662,
                13349295795,
                15255560423,
                15395192423,
                15056956025,
                13856919304,
                13721054751,
                15155138673,
                13865511161,
                17681179208,
                13865962700,
                15956983877,
                13739249995,
                15855158486,
                18715061721,
                13866669221,
                13956056477,
                17751718600,
                15395130118,
                15375408536,
                13485510006,
                18856061342,
                15856904181,
                18756060793,
                18256902676,
                13301064017,
                13966768587
            ];
        }
        ajax.get({
            url: base + 'weixin/guide/firstRecommend.jhtml',
            data: data,
            traditional: true,
            success: this.fn
        });
    },
    /**
     * 导购详情
     * memberId 会员id
     * lat 纬度
     * lnt 经度
     */
    view: function (data) {
        ajax.get({
            url: base + 'weixin/guide/view.jhtml',
            data: data,
            success: this.fn
        })
    },
    /**
     * 导购粉丝
     * memberId 会员id
     * pageSize 页大小
     * pageNumber 页号
     */
    fansList: function (data) {
        ajax.get({
            url: base + 'weixin/guide/fans/list.jhtml',
            data: data,
            success: this.fn
        })
    },
    /**
     * 分享商品加入推荐
     * productId    商品Id
     */
    recommend: function (data) {
        ajax.post({
            url: base + 'weixin/guide/recommend.jhtml',
            data: data,
            success: this.fn
        })
    },
    /**
     * 导购详情页的推荐商品
     * employeeId  员工id
     */
    recommondProduct: function (data) {
        ajax.get({
            url: base + 'weixin/guide/recommend/product.jhtml',
            data: data,
            success: this.fn
        })
    },
    /**
     * 修改最后活跃时间
     */
    updateActiveDate: function (data) {
        ajax.get({
            url: base + 'weixin/guide/updateActiveDate.jhtml',
            data: data,
            success: this.fn
        })
    },
    /**
     * 导购或店主已绑定手机号自动申请成为合伙人
     */
    autoApply: function () {
        ajax.post({
            url: base + "weixin/member/partner/autoApply.jhtml",
            success: this.fn
        })
    }

};